from meshok import Meshok

def test_init_meshok():
    result = Meshok()._barrels # нарушаем инкапсуляцию, лезем в скрытое свойство _barrels
    exp_result = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90]
    assert result == exp_result, 'Генерация полного мешка с боченками от 1 до 90'

def test_get_new_barrel():
    meshok = Meshok()
    for _ in range(90): meshok.get_new() # 90 раз вызываем функцю новый боченок. не должно остаться боченков
    result = meshok._barrels
    exp_result = []
    assert result == exp_result, 'Вытаскиваем 90 раз новый боченок, должен остаться пустой список'